; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v5 - type_3 ?v2 - type_1)
 	      (pred_2 ?v8 - object ?v2 - type_1)
	      (pred_4 ?v5 - type_3 ?v6 - type_2)
	      (pred_3 ?v5 - type_3 ?v8 - object ?v6 - type_2))

   (:action op_3
       :parameters  (?v5 - type_3 ?v3 ?v1 - type_1)
       :precondition (and  (pred_1 ?v5 ?v3))
       :effect (and  (pred_1 ?v5 ?v1)
		     (not (pred_1 ?v5 ?v3))))

   (:action op_1
       :parameters (?v5 - type_3 ?v7 - object ?v4 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v4) (pred_1 ?v5 ?v4) (pred_4 ?v5 ?v6))
       :effect (and (pred_3 ?v5 ?v7 ?v6)
		    (not (pred_2 ?v7 ?v4)) 
		    (not (pred_4 ?v5 ?v6))))

   (:action op_2
       :parameters (?v5 - type_3 ?v7 - object ?v4 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v7 ?v6) (pred_1 ?v5 ?v4))
       :effect (and (pred_2 ?v7 ?v4)
		    (pred_4 ?v5 ?v6)
		    (not (pred_3 ?v5 ?v7 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_03 - type_3
obj_07 obj_01 - type_2
obj_08 obj_06 obj_04 - type_1
obj_09 obj_05 obj_02 - object)
(:init
(pred_1 obj_03 obj_08)
(pred_4 obj_03 obj_07)
(pred_4 obj_03 obj_01)
(pred_2 obj_09 obj_06)
(pred_2 obj_05 obj_06)
(pred_2 obj_02 obj_08)
)
(:goal
(and
(pred_2 obj_09 obj_06)
(pred_2 obj_05 obj_08)
(pred_2 obj_02 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_03 ?b obj_07))))
)
)

; plan
1. (op_1 obj_03 obj_02 obj_08 obj_01)
   deleted: (pred_2 obj_02 obj_08) (pred_4 obj_03 obj_01)
   added: (pred_3 obj_03 obj_02 obj_01)
   goals met: 1 of 3
2. (op_3 obj_03 obj_08 obj_06)
   deleted: (pred_1 obj_03 obj_08)
   added: (pred_1 obj_03 obj_06)
   goals met: 1 of 3
3. (op_2 obj_03 obj_02 obj_06 obj_01)
   deleted: (pred_3 obj_03 obj_02 obj_01)
   added: (pred_2 obj_02 obj_06) (pred_4 obj_03 obj_01)
   goals met: 2 of 3
4. (op_1 obj_03 obj_05 obj_06 obj_01)
   deleted: (pred_2 obj_05 obj_06) (pred_4 obj_03 obj_01)
   added: (pred_3 obj_03 obj_05 obj_01)
   goals met: 2 of 3
5. (op_3 obj_03 obj_06 obj_08)
   deleted: (pred_1 obj_03 obj_06)
   added: (pred_1 obj_03 obj_08)
   goals met: 2 of 3
6. (op_2 obj_03 obj_05 obj_08 obj_01)
   deleted: (pred_3 obj_03 obj_05 obj_01)
   added: (pred_2 obj_05 obj_08) (pred_4 obj_03 obj_01)
   goals met: 3 of 3
